CSI API ETABS v1

# cGridSys Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cGridSys

    Public Interface cGridSys

    Dim instance As cGridSys

    public interface class cGridSys

    type cGridSys =  interface end

The cGridSys type exposes the following members.

Methods

| Name| Description
---|---|---
|
ChangeName|  Changes the name of a
defined grid system.
|
Count|  Retrieves the number of
defined grid systems.
|
Delete|  Deletes the specified
grid system.
|
GetGridSys|  Retrieves the grid
system specified by the Name item.
|
GetGridSys_2|  Retrieves the grid
system specified by the Name item.
|
GetGridSysCartesian|
|
GetGridSysCylindrical|
|
GetGridSysType|
|
GetNameList|  Retrieves the names
of all defined grid systems.
|
GetNameTypeList|
|
GetTransformationMatrix|
Retrieves the grid system transformation matrix.
|
SetGridSys|  Adds a new grid
system, or modifies an existing grid system.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com